import { Inter } from "next/font/google";
import "./globals.css";
import Navbar from "@/components/Navbar";
import Footer from "@/components/Footer";

const inter = Inter({ subsets: ["latin"] });

export const metadata = {
  title: "BBDJIC",
  description: "BBDJIC babu banarasi das janta inter collage विद्यालय की स्थापना का उद्देश्य बालक एवं बालिकाओं के सर्वांगीण विकास के साथ – साथ अपने गाँव, समाज एवं देश के विकास की परम्परा को सतत् नया आयाम देने एवं ज्ञान की अखंड ज्योति को प्रज्वलित करने का अथक प्रयास, प्रथम प्रबंधक एवं इस विद्यालय के संस्थापक स्वतंत्रता संग्राम सेनानी स्वर्गीय श्री भूदेव सिंह जी के द्वारा इस विद्यालय की नीव रखी गई | आप का जन्म 10 मार्च 1916 को हुआ था एवं परलोक वास वर्ष 20 जनवरी 2011 को हो गया | स्वर्गीय श्री भूदेव सिंह जी के भागीरथ प्रयास को निरंतर आगे बढाने का कार्य अध्यक्ष स्वर्गीय श्री खचेडू सिंह जी के द्वारा किया गया | वर्तमान समय में इस विद्यालय में श्री मेजर हरबीर सिंह जी अध्यक्ष के पद पर आसीन हैं, जो तन मन धन से इस विद्यालय के विकास के लिए अपना अद्दितीय मार्ग दर्शन  एवं सहयोग प्रदान कर रहे हैं एवं विद्यालय परिवार आप से अपेक्षा करता है कि आप भविष्य में भी मार्गदर्शन एवं सहयोग करते रहेंगे| विद्यालय परिवार आपके  अथक प्रयास एवं सहयोग का हमेशा आभारी रहेगा |वर्तमान समय में इस विद्यालय में स्वतंत्रता संग्राम सेनानी स्वर्गीय श्री भूदेव सिंह जी के सुपुत्र श्री देवेन्द्र पाल सिंह जी प्रबन्धक के पद पर आसीन हैं जो अपने पिता श्री के पद चिन्हों पर चल कर ज्ञान की गंगा बहाने के लिय हमेशा प्रयासरत्त रहे हैं और आप भविष्य में भी प्रयासरत्त रहेंगे | इस विद्यालय में वर्तमान समय में स्वर्गीय श्री खचेडू सिंह जी के सुपुत्र श्री कुँवर पाल सिंह जी उपाध्यक्ष के पद पर आसीन हैं, जो वर्तमान में इस विद्यालय रुपी बगीचे को अपने अथक प्रयास एवं परिश्रम से सजाने एवं संवारने का कार्य अपने पूर्ण तन-मन-धन से कर रहे है |वर्तमान समय में  स्वर्गीय श्री हाजी रौनक अली जी के सुपुत्र श्री रासिद अली जी इस विद्यालय में कोषाध्यक्ष के पद पर आसीन हैं जो तन-मन-धन से  ज्ञान की गंगा बहाने के लिय हमेशा प्रयासरत्त रहते है और  विद्यालय की भलाई के लिए हमेशा मार्गदर्शन करते रहते हैं |",
};

export default function RootLayout({ children }) {
  return (
    <html lang="en">
   
      <body className={inter.className}>
      <Navbar/>
      {children}
      <Footer/>

      
      </body>
    </html>
  );
}
